# Introduction to Pandas

*Written by Luke Chang & Jin Cheong*

Analyzing data requires being facile with manipulating and transforming datasets to be able to test specific hypotheses. Data come in all different types of flavors and there are many different tools in the Python ecosystem to work with pretty much any type of data you might encounter. For example, you might be interested in working with functional neuroimaging data that is four dimensional. Three dimensional matrices contain brain activations in space, and these data can change over time in the 4th dimension. This type of data is well suited for [numpy](https://numpy.org/) and specialized brain imaging packages such as [nilearn](https://nilearn.github.io/). The majority of data, however, is typically in some version of a two-dimensional observations by features format as might be seen in an excel spreadsheet, a SQL table, or in a comma delimited format (i.e., csv). 

In Python, the [Pandas](https://pandas.pydata.org/) library is a powerful tool to work with this type of data. This is a very large library with a tremendous amount of functionality. In this tutorial, we will cover the basics of how to load and manipulate data and will focus on common to data munging tasks.

For those interested in diving deeper into Pandas, there are many online resources. There is the [Pandas online documention](https://pandas.pydata.org/), [stackoverflow](https://stackoverflow.com/questions/tagged/pandas), and [medium blogposts](https://medium.com/search?q=pandas). I highly recommend  Jake Vanderplas's terrific [Python Data Science Handbook](https://jakevdp.github.io/PythonDataScienceHandbook/).   In addition, here is a brief [video](https://neurohackademy.org/course/complex-data-structures/) by Tal Yarkoni providing a useful introduction to pandas. 

After the tutorial you will have the chance to apply the methods to a new set of data.

# Pandas Objects

Pandas has several objects that are commonly used (i.e., Series, DataFrame, Index). At it's core, Pandas Objects are enhanced numpy arrays where columns and rows can have special names and there are lots of methods to operate on the data. See Jake Vanderplas's [tutorial](https://github.com/jakevdp/PythonDataScienceHandbook/blob/master/notebooks/03.01-Introducing-Pandas-Objects.ipynb) for a more in depth overview.

## Series
A pandas `Series` is a one-dimensional array of indexed data.

In [3]:
import pandas as pd

data = pd.Series([1, 2, 3, 4, 5])
data

0    1
1    2
2    3
3    4
4    5
dtype: int64

The indices can be integers like in the example above. Alternatively, the indices can be labels.

In [5]:
data = pd.Series([1,2,3], index=['a', 'b', 'c'])
data

a    1
b    2
c    3
dtype: int64

Also, `Series` can be easily created from dictionaries

In [6]:
data = pd.Series({'A':5, 'B':3, 'C':1})
data

A    5
B    3
C    1
dtype: int64

## DataFrame
If a `Series` is a one-dimensional indexed array, the `DataFrame` is a two-dimensional indexed array. It can be thought of as a collection of Series objects, where each Series represents a column, or as an enhanced 2D numpy array. 

In a `DataFrame`, the index refers to labels for each row, while columns describe each column.

First, let's create a `DataFrame` using random numbers generated from numpy.

In [9]:
import numpy as np

data = pd.DataFrame(np.random.random((5, 3)))
data

          0         1         2
0  0.440204  0.972168  0.903669
1  0.453819  0.304966  0.609482
2  0.568885  0.513902  0.290198
3  0.360383  0.202284  0.853531
4  0.401475  0.756353  0.252568

We could also initialize with column names

In [10]:
data = pd.DataFrame(np.random.random((5, 3)), columns=['A', 'B', 'C'])
data

          A         B         C
0  0.610127  0.028931  0.031854
1  0.572679  0.706560  0.651736
2  0.568858  0.137557  0.951631
3  0.417056  0.919711  0.338568
4  0.523557  0.057718  0.423419

Alternatively, we could create a `DataFrame` from multiple `Series` objects.

In [15]:
a = pd.Series([1, 2, 3, 4])
b = pd.Series(['a', 'b', 'c', 'd'])
data = pd.DataFrame({'Numbers':a, 'Letters':b})
data

   Numbers Letters
0        1       a
1        2       b
2        3       c
3        4       d

Or a python dictionary

In [20]:
data = pd.DataFrame({'State':['California', 'Colorado', 'New Hampshire'], 
                     'Capital':['Sacremento', 'Denver', 'Concord']})
data

           State     Capital
0     California  Sacremento
1       Colorado      Denver
2  New Hampshire     Concord

# Loading Data
Loading data is fairly straightfoward in Pandas. Type `pd.read` then press tab to see a list of functions that can load specific file formats such as: csv, excel, spss, and sql. 

In this example, we will use `pd.read_csv` to load a .csv file into a dataframe. 
Note that read_csv() has many options that can be used to make sure you load the data correctly. You can explore the docstrings for a function to get more information about the inputs and general useage guidelines by running `pd.read_csv?`

In [23]:
pd.read_csv?

To load a csv file we will need to specify either the relative or absolute path to the file.

The command `pwd` will print the path of the current working directory.

In [21]:
pwd

'/Users/lukechang/Dropbox/Dartbrains/Notebooks'

We will now load the Pandas has many ways to read data different data formats into a dataframe.  Here we will use the `pd.read_csv` function.

In [26]:
df = pd.read_csv('/Users/lukechang/Dropbox/Dartbrains/Data/salary/salary.csv', sep = ',')
# df = pd.read_csv('psych60/data/salary/salary.csv', sep = ',')

## Ways to check the dataframe
There are many ways to examine your dataframe. One easy way is to just call the dataframe variable itself.

In [27]:
df

    salary  gender departm  years   age  publications
0    86285       0     bio   26.0  64.0            72
1    77125       0     bio   28.0  58.0            43
2    71922       0     bio   10.0  38.0            23
3    70499       0     bio   16.0  46.0            64
4    66624       0     bio   11.0  41.0            23
..     ...     ...     ...    ...   ...           ...
72   53662       1   neuro    1.0  31.0             3
73   57185       1    stat    9.0  39.0             7
74   52254       1    stat    2.0  32.0             9
75   61885       1    math   23.0  60.0             9
76   49542       1    math    3.0  33.0             5

[77 rows x 6 columns]

However, often the dataframes can be large and we may be only interested in seeing the first few rows.  `df.head()` is useful for this purpose.

In [29]:
df.head()

   salary  gender departm  years   age  publications
0   86285       0     bio   26.0  64.0            72
1   77125       0     bio   28.0  58.0            43
2   71922       0     bio   10.0  38.0            23
3   70499       0     bio   16.0  46.0            64
4   66624       0     bio   11.0  41.0            23

On the top row, you have column names, that can be called like a dictionary (a dataframe can be essentially thought of as a dictionary with column names as the keys). The left most column (0,1,2,3,4...) is called the index of the dataframe. The default index is sequential integers, but it can be set to anything as long as each row is unique (e.g., subject IDs)

In [8]:
print("Indexes")
print(df.index)
print("Columns")
print(df.columns)
print("Columns are like keys of a dictionary")
print(df.keys())

Indexes
RangeIndex(start=0, stop=77, step=1)
Columns
Index(['salary', 'gender', 'departm', 'years', 'age', 'publications'], dtype='object')
Columns are like keys of a dictionary
Index(['salary', 'gender', 'departm', 'years', 'age', 'publications'], dtype='object')

You can access the values of a column by calling it directly. Single bracket returns a `Series` and double bracket returns a `dataframe`.

Let's return the first 10 rows of salary.

In [35]:
df['salary'][:10]

0    86285
1    77125
2    71922
3    70499
4    66624
5    64451
6    64366
7    59344
8    58560
9    58294
Name: salary, dtype: int64

`shape` is another useful method for getting the dimensions of the matrix.  

We will print the number of rows and columns in this data set using fstring formatting. First, you need to specify a string starting with 'f', like this `f'anything'`. It is easy to insert variables with curly brackets like this `f'rows: {rows}'`. 

[Here](https://realpython.com/python-f-strings/) is more info about formatting text.

In [28]:
rows, cols = df.shape
print(f'There are {rows} rows and {cols} columns in this data set')

There are 77 rows and 6 columns in this data set

## Describing the data
We can use the `.describe()` method to get a quick summary of the continuous values of the data frame. We will `.transpose()` the output to make it slightly easier to read.

In [26]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
salary,75.0,67293.946667,14672.455177,44687.000000,56638.500000,62557.000000,74733.500000,112800.0
gender,75.0,0.146667,0.392268,0.000000,0.000000,0.000000,0.000000,2.0
years,75.0,14.840000,8.596102,1.000000,8.000000,14.000000,22.500000,34.0
age,75.0,45.426667,9.051166,31.000000,38.000000,44.000000,53.000000,65.0
publications,75.0,21.440000,15.200676,3.000000,9.000000,18.000000,32.500000,72.0
pubperyear,75.0,1.926595,1.602968,0.173913,0.775253,1.653846,2.563187,8.0

We can also get quick summary of a pandas series, or specific column of a pandas dataframe.

In [27]:
df.departm.describe()

count      75
unique      7
top       bio
freq       16
Name: departm, dtype: object

Sometimes, you will want to know how many data points are associated with a specific variable for categorical data. The `value_counts` method can be used for this goal.

For example, how many males and females are in this dataset?

In [38]:
df['gender'].value_counts()

0    67
1     9
2     1
Name: gender, dtype: int64

You can see that there are more than 2 genders specified in our data. 

This is likely an error in the data collection process. It's always up to the data analyst to decide what to do in these cases. Because we don't know what the true value should have been, let's just remove the row from the dataframe by finding all rows that are not '2'.

In [42]:
df = df.loc[df['gender']!=2]

df['gender'].value_counts()

0    67
1     9
Name: gender, dtype: int64

## Dealing with missing values
Data are always messy and often have lots of missing values. There are many different ways, in which missing data might present `NaN`, `None`, or `NA`, Sometimes researchers code missing values with specific numeric codes such as 999999. It is important to find these as they can screw up your analyses if they are hiding in your data. 

If the missing values are using a standard pandas or numpy value such as `NaN`, `None`, or `NA`, we can identify where the missing values are as booleans using the `isnull()` method. 

The `isnull()` method will return a dataframe with True/False values on whether a datapoint is null or not a number (nan).

In [43]:
df.isnull()

    salary  gender  departm  years    age  publications
0    False   False    False  False  False         False
1    False   False    False  False  False         False
2    False   False    False  False  False         False
3    False   False    False  False  False         False
4    False   False    False  False  False         False
..     ...     ...      ...    ...    ...           ...
72   False   False    False  False  False         False
73   False   False    False  False  False         False
74   False   False    False  False  False         False
75   False   False    False  False  False         False
76   False   False    False  False  False         False

[76 rows x 6 columns]

Suppose we wanted to count the number of missing values for each column in the dataset.

One thing that is  nice about Python is that you can chain commands, which means that the output of one method can be the input into the next method.  This allows us to write intuitive and concise code.  Notice how we take the `sum()` of all of the null cases.
We can chain the `.null()` and `.sum()` methods to see how many null values are added up in each column.

In [44]:
df.isnull().sum()

salary          0
gender          0
departm         0
years           1
age             1
publications    0
dtype: int64

You can use the boolean indexing once again to see the datapoints that have missing values. We chained the method `.any()` which will check if there are any True values for a given axis.  Axis=0 indicates rows, while Axis=1 indicates columns.  So here we are creating a boolean index for row where *any* column has a missing value.

In [45]:
df[df.isnull().any(axis=1)]

    salary  gender departm  years   age  publications
18   64762       0    chem   25.0   NaN            29
24  104828       0    geol    NaN  50.0            44

You may look at where the values are not null. Note that indexes 18, and 24 are missing.

In [46]:
df[~df.isnull().any(axis=1)]

    salary  gender departm  years   age  publications
0    86285       0     bio   26.0  64.0            72
1    77125       0     bio   28.0  58.0            43
2    71922       0     bio   10.0  38.0            23
3    70499       0     bio   16.0  46.0            64
4    66624       0     bio   11.0  41.0            23
..     ...     ...     ...    ...   ...           ...
72   53662       1   neuro    1.0  31.0             3
73   57185       1    stat    9.0  39.0             7
74   52254       1    stat    2.0  32.0             9
75   61885       1    math   23.0  60.0             9
76   49542       1    math    3.0  33.0             5

[74 rows x 6 columns]

There are different techniques for dealing with missing data.  An easy one is to simply remove rows that have any missing values using the `dropna()` method.

In [48]:
df.dropna(inplace=True)

Now we can check to make sure the missing rows are removed.  Let's also check the new dimensions of the dataframe.

In [50]:
rows, cols = df.shape
print(f'There are {rows} rows and {cols} columns in this data set') 

df.isnull().sum()

There are 74 rows and 6 columns in this data set

salary          0
gender          0
departm         0
years           0
age             0
publications    0
dtype: int64

## Create New Columns
You can create new columns to fit your needs. 
For instance you can set initialize a new column with zeros.

In [51]:
df['pubperyear'] = 0

Here we can create a new column pubperyear, which is the ratio of the number of papers published per year

In [52]:
df['pubperyear'] = df['publications']/df['years']

# Indexing and slicing Data - LUKE HERE

rows vs columns


Indexing in Pandas can be tricky. There are four ways to index: loc, iloc, and explicit indexing(useful for booleans).  


First, we will try using `.loc`.  This method references the explicit index. it works for both index names and also column names.

## Indexing with Keys

In [15]:
df.loc[0, ['salary']]

salary    86285
Name: 0, dtype: object

Next we wil try `.iloc`.  This method references the implicit python index (starting from 0, exclusive of last number).  You can think of this like row by column indexing using integers.

## Indexing with Integers

In [16]:
df.iloc[0:3, 0:3]

   salary  gender departm
0   86285       0     bio
1   77125       0     bio
2   71922       0     bio

Let's make a new data frame with just Males and another for just Females. Notice, how we added the `.reset_index(drop=True)` method?   This is because assigning a new dataframe based on indexing another dataframe will retain the *original* index.  We need to explicitly tell pandas to reset the index if we want it to start from zero.

In [50]:
male_df = df[df.gender == 0].reset_index(drop=True)
female_df = df[df.gender == 1].reset_index(drop=True)


Boolean or logical indexing is useful if you need to sort the data based on some True or False value.  

For instance, who are the people with salaries greater than 90K but lower than 100K ?

In [19]:
df[ (df.salary > 90000) & (df.salary < 100000)]

    salary  gender  departm  years   age  publications  pubperyear
14   97630       0     chem   34.0  64.0            43    1.264706
30   92951       0    neuro   11.0  41.0            20    1.818182
54   96936       0  physics   15.0  50.0            17    1.133333

## Indexing with booleans

## Renaming
- columns
- rows with map

# Operations

# Merging Data

## Concat
https://github.com/jakevdp/PythonDataScienceHandbook/blob/master/notebooks/03.06-Concat-And-Append.ipynb

## Append

## Merge
https://github.com/jakevdp/PythonDataScienceHandbook/blob/master/notebooks/03.07-Merge-and-Join.ipynb

# Aggregation and Grouping
https://github.com/jakevdp/PythonDataScienceHandbook/blob/master/notebooks/03.08-Aggregation-and-Grouping.ipynb

## Groupby

## Split, Apply, Combine

## Transform

## Manipulating data in Groups
One manipulation we often do is look at variables in groups. 
One way to do this is to usethe `.groupby(key)` method. 
The key is a column that is used to group the variables together. 
For instance, if we want to group the data by gender and get group means, we perform the following.

In [28]:
df.groupby('gender').mean()

              salary      years        age  publications  pubperyear
gender
0       69108.492308  15.846154  46.492308     23.061538    1.924709
1       55719.666667   8.666667  38.888889     11.555556    2.043170
2       53517.000000   5.000000  35.000000      5.000000    1.000000

Other default aggregation methods include .count(), .mean(), .median(), .min(), .max(), .std(), .var(), and .sum()

Before we move on, it looks like there were more than 2 genders specified in our data. 
This is likely an error in the data collection process so let recap on how we might remove this datapoint.

In [29]:
df[df['gender']==2]

    salary  gender departm  years   age  publications  pubperyear
67   53517       2    math    5.0  35.0             5         1.0

replace original dataframe without the miscoded data

In [30]:
df = df[df['gender']!=2]

Now we have a corrected dataframe!

In [31]:
df.groupby('gender').mean()

              salary      years        age  publications  pubperyear
gender
0       69108.492308  15.846154  46.492308     23.061538    1.924709
1       55719.666667   8.666667  38.888889     11.555556    2.043170

Another powerful tool in Pandas is the split-apply-combine method. 
For instance, let's say we also want to look at how much each professor is earning in respect to the department. 
Let's say we want to subtract the departmental mean from professor and divide it by the departmental standard deviation. 
We can do this by using the `groupby(key)` method chained with the `.transform(function)` method. 
It will group the dataframe by the key column, perform the "function" transformation of the data and return data in same format.
To learn more, see link [here](http://nbviewer.jupyter.org/github/jakevdp/PythonDataScienceHandbook/blob/master/notebooks/03.08-Aggregation-and-Grouping.ipynb)

In [32]:
# key: We use the departm as the grouping factor. 
key = df['departm']

# Let's create an anonmyous function for calculating zscores using lambda:
# We want to standardize salary for each department.
zscore = lambda x: (x - x.mean()) / x.std()

# Now let's calculate zscores separately within each department
transformed = df.groupby(key).transform(zscore)
df['salary_in_departm'] = transformed['salary']

# Reshaping Data

wide vs long

## Melt

## Pivot

# Switching between datatypes

In [ ]:
dictionaries

Now we have `salary_in_departm` column showing standardized salary per department.

In [33]:
df.head()

,salary,gender,departm,years,age,publications,pubperyear,salary_in_departm
0,86285,0,bio,26.0,64.0,72,2.769231,2.468065
1,77125,0,bio,28.0,58.0,43,1.535714,1.493198
2,71922,0,bio,10.0,38.0,23,2.300000,0.939461
3,70499,0,bio,16.0,46.0,64,4.000000,0.788016
4,66624,0,bio,11.0,41.0,23,2.090909,0.375613

## Combining datasets - pd.concat
Recall that we sliced the dataframes into male and female dataframe in 2.3 Indexing and Slicing. Now we will learn how to put dataframes together which is done by the pd.concat method. Note how the index of this output retains the old index.

In [53]:
pd.concat([femaledf, maledf],axis = 0)

    salary  gender  departm  years   age  publications  pubperyear
0    59139       1      bio    8.0  38.0            23    2.875000
1    52968       1      bio   18.0  48.0            32    1.777778
2    55949       1     chem    4.0  34.0            12    3.000000
3    58893       1    neuro   10.0  35.0             4    0.400000
4    53662       1    neuro    1.0  31.0             3    3.000000
5    57185       1     stat    9.0  39.0             7    0.777778
6    52254       1     stat    2.0  32.0             9    4.500000
7    61885       1     math   23.0  60.0             9    0.391304
8    49542       1     math    3.0  33.0             5    1.666667
0    86285       0      bio   26.0  64.0            72    2.769231
1    77125       0      bio   28.0  58.0            43    1.535714
2    71922       0      bio   10.0  38.0            23    2.300000
3    70499       0      bio   16.0  46.0            64    4.000000
4    66624       0      bio   11.0  41.0            23    2.090909
5    64451       0      bio   23.0  60.0            44    1.913043
6    64366       0      bio   23.0  53.0            22    0.956522
7    59344       0      bio    5.0  40.0            11    2.200000
8    58560       0      bio    8.0  38.0             8    1.000000
9    58294       0      bio   20.0  50.0            12    0.600000
10   56092       0      bio    2.0  40.0             4    2.000000
11   54452       0      bio   13.0  43.0             7    0.538462
12   54269       0      bio   26.0  56.0            12    0.461538
13   55125       0      bio    8.0  38.0             9    1.125000
14   97630       0     chem   34.0  64.0            43    1.264706
15   82444       0     chem   31.0  61.0            42    1.354839
16   76291       0     chem   29.0  65.0            33    1.137931
17   75382       0     chem   26.0  56.0            39    1.500000
18   64762       0     chem   25.0   NaN            29    1.160000
19   62607       0     chem   20.0  45.0            34    1.700000
20   60373       0     chem   26.0  56.0            43    1.653846
..     ...     ...      ...    ...   ...           ...         ...
37   66482       0    neuro   14.0  44.0            42    3.000000
38   61680       0    neuro   18.0  48.0            20    1.111111
39   60455       0    neuro    8.0  38.0            49    6.125000
40   58932       0    neuro   11.0  41.0            49    4.454545
41  106412       0     stat   23.0  53.0            29    1.260870
42   86980       0     stat   23.0  53.0            42    1.826087
43   78114       0     stat    8.0  38.0            24    3.000000
44   74085       0     stat   11.0  41.0            33    3.000000
45   72250       0     stat   26.0  56.0             9    0.346154
46   69596       0     stat   20.0  50.0            18    0.900000
47   65285       0     stat   20.0  50.0            15    0.750000
48   62557       0     stat   28.0  58.0            14    0.500000
49   61947       0     stat   22.0  58.0            17    0.772727
50   58565       0     stat   29.0  59.0            11    0.379310
51   58365       0     stat   18.0  48.0            21    1.166667
52   53656       0     stat    2.0  32.0             4    2.000000
53   51391       0     stat    5.0  35.0             8    1.600000
54   96936       0  physics   15.0  50.0            17    1.133333
55   83216       0  physics   11.0  37.0            19    1.727273
56   72044       0  physics    2.0  32.0            16    8.000000
57   64048       0  physics   23.0  53.0             4    0.173913
58   58888       0  physics   26.0  56.0             7    0.269231
59   58744       0  physics   20.0  50.0             9    0.450000
60   55944       0  physics   21.0  51.0             8    0.380952
61   54076       0  physics   19.0  49.0            12    0.631579
62   82142       0     math    9.0  39.0             9    1.000000
63   70509       0     math   23.0  53.0             7    0.304348
64   60320       0     math   14.0  44.0             7    0.500000
65   55814       0     math    8.0  38.0             6    0.750000
66   53638       0     math    4.0  42.0             8    2.000000

[76 rows x 7 columns]

We can reset the index to start at zero using the .reset_index() method

In [54]:
pd.concat([maledf, femaledf], axis = 0).reset_index(drop=True)

    salary  gender  departm  years   age  publications  pubperyear
0    86285       0      bio   26.0  64.0            72    2.769231
1    77125       0      bio   28.0  58.0            43    1.535714
2    71922       0      bio   10.0  38.0            23    2.300000
3    70499       0      bio   16.0  46.0            64    4.000000
4    66624       0      bio   11.0  41.0            23    2.090909
5    64451       0      bio   23.0  60.0            44    1.913043
6    64366       0      bio   23.0  53.0            22    0.956522
7    59344       0      bio    5.0  40.0            11    2.200000
8    58560       0      bio    8.0  38.0             8    1.000000
9    58294       0      bio   20.0  50.0            12    0.600000
10   56092       0      bio    2.0  40.0             4    2.000000
11   54452       0      bio   13.0  43.0             7    0.538462
12   54269       0      bio   26.0  56.0            12    0.461538
13   55125       0      bio    8.0  38.0             9    1.125000
14   97630       0     chem   34.0  64.0            43    1.264706
15   82444       0     chem   31.0  61.0            42    1.354839
16   76291       0     chem   29.0  65.0            33    1.137931
17   75382       0     chem   26.0  56.0            39    1.500000
18   64762       0     chem   25.0   NaN            29    1.160000
19   62607       0     chem   20.0  45.0            34    1.700000
20   60373       0     chem   26.0  56.0            43    1.653846
21   58892       0     chem   18.0  48.0            21    1.166667
22   47021       0     chem    4.0  34.0            12    3.000000
23   44687       0     chem    4.0  34.0            19    4.750000
24  104828       0     geol    NaN  50.0            44         NaN
25   71456       0     geol   11.0  41.0            32    2.909091
26   65144       0     geol    7.0  37.0            12    1.714286
27   52766       0     geol    4.0  38.0            32    8.000000
28  112800       0    neuro   14.0  44.0            33    2.357143
29  105761       0    neuro    9.0  39.0            30    3.333333
..     ...     ...      ...    ...   ...           ...         ...
46   69596       0     stat   20.0  50.0            18    0.900000
47   65285       0     stat   20.0  50.0            15    0.750000
48   62557       0     stat   28.0  58.0            14    0.500000
49   61947       0     stat   22.0  58.0            17    0.772727
50   58565       0     stat   29.0  59.0            11    0.379310
51   58365       0     stat   18.0  48.0            21    1.166667
52   53656       0     stat    2.0  32.0             4    2.000000
53   51391       0     stat    5.0  35.0             8    1.600000
54   96936       0  physics   15.0  50.0            17    1.133333
55   83216       0  physics   11.0  37.0            19    1.727273
56   72044       0  physics    2.0  32.0            16    8.000000
57   64048       0  physics   23.0  53.0             4    0.173913
58   58888       0  physics   26.0  56.0             7    0.269231
59   58744       0  physics   20.0  50.0             9    0.450000
60   55944       0  physics   21.0  51.0             8    0.380952
61   54076       0  physics   19.0  49.0            12    0.631579
62   82142       0     math    9.0  39.0             9    1.000000
63   70509       0     math   23.0  53.0             7    0.304348
64   60320       0     math   14.0  44.0             7    0.500000
65   55814       0     math    8.0  38.0             6    0.750000
66   53638       0     math    4.0  42.0             8    2.000000
67   59139       1      bio    8.0  38.0            23    2.875000
68   52968       1      bio   18.0  48.0            32    1.777778
69   55949       1     chem    4.0  34.0            12    3.000000
70   58893       1    neuro   10.0  35.0             4    0.400000
71   53662       1    neuro    1.0  31.0             3    3.000000
72   57185       1     stat    9.0  39.0             7    0.777778
73   52254       1     stat    2.0  32.0             9    4.500000
74   61885       1     math   23.0  60.0             9    0.391304
75   49542       1     math    3.0  33.0             5    1.666667

[76 rows x 7 columns]

### Plotting Categorical Variables. Replacing variables with .map
If we want to plot department on the x-axis, Pandas plotting functions won't know what to do
because they don't know where to put bio or chem on a numerical x-axis. 
Therefore one needs to change them to numerical variable to plot them with basic functionalities (we will later see how Seaborn sovles this).

In [55]:
df['dept_num'] = 0
df.loc[:, ['dept_num']] = df.departm.map({'bio':0, 'chem':1, 'geol':2, 'neuro':3, 'stat':4, 'physics':5, 'math':6})
df.tail()

,salary,gender,departm,years,age,publications,pubperyear,salary_in_departm,dept_num
72,53662,1,neuro,1.0,31.0,3,3.000000,-1.270712,3
73,57185,1,stat,9.0,39.0,7,0.777778,-0.677103,4
74,52254,1,stat,2.0,32.0,9,4.500000,-1.009063,4
75,61885,1,math,23.0,60.0,9,0.391304,-0.008401,6
76,49542,1,math,3.0,33.0,5,1.666667,-1.116592,6

Now plot all four categories

The problem is that it treats department as a continuous variable.

# Exercises ( Homework)
The following exercises uses the dataset "salary_exercise.csv" adapted from material available [here](http://data.princeton.edu/wws509/datasets/#salary)

These are the salary data used in Weisberg's book, consisting of observations on six variables for 52 tenure-track professors in a small college. The variables are:

 - sx = Sex, coded 1 for female and 0 for male
 - rk = Rank, coded
 - 1 for assistant professor,
 - 2 for associate professor, and
 - 3 for full professor
 - yr = Number of years in current rank
 - dg = Highest degree, coded 1 if doctorate, 0 if masters
 - yd = Number of years since highest degree was earned
 - sl = Academic year salary, in dollars.

Reference: S. Weisberg (1985). Applied Linear Regression, Second Edition. New York: John Wiley and Sons. Page 194.

## Exercise 1

Read the salary_exercise.csv into a dataframe, and change the column names to a more readable format such as 
sex, rank, yearsinrank, degree, yearssinceHD, and salary.   
Clean the data by excluding rows with any missing value. 
What are the overall mean, standard deviation, min, and maximum of professors' salary?

## Exercise 2
Using the same data, what are the means and standard deviations of salary for different professor ranks?   
Create a new column on the original dataframe in which you calculate the standardized salary for each "rank" group.

## Exercise 3
Recreate the plot shown in figure.   
On the left is a correlation of all parameters of only the male professors.  
On the right is the same but only for female professors.   
The colormap code used is `RdBu_r`. Read the Docstrings on sns.heatmap or search the internet to figure out how to change the colormap, scale the colorbar, and create square line boundaries.   
Place titles for each plot as shown, and your name as the main title.   

![](../images/labs/plotting/hw2-3.png)

## Exercise 4
Recreate the following plot from the salary_exercise.csv dataset.   
Create a 1 x 2 subplot.   
On the left is a bar-errorbar of salary per gender.   
On the right is a scatterplot of salary on y-axis and years in rank on the x-axis.  
Set the axis limits as shown in the picture and modify their lables.   
Add axis label names.   
Add a legend for the scatterplot and place it at a bottom-right location.  
Add your name as the main title of the plot.   

![](../images/labs/plottinghw2-4.png)